{
    "Nara": "It can be captured during the 'Deena is Reborn' quest. After that, we can talk to Eliza to release captured legendaries again and it'll it'll likely appear in the Hidden Village region, although this hasn't been confirmed.",
    "Ventra": "It can be captured during the 'Nadine is Reborn' quest. After that, we can talk to Eliza to release captured legendaries again and it'll likely appear in the Drake Isles, although this hasn't been confirmed.",
    "Vados": "It can't be captured in the wild, only evolved from Protovados.",
    "Omnisun": "It can't be captured in the wild, only evolved from Solus.",
    "Hexia": "It can be only found roaming in the Precursor Valley but might need to complete the DLC and ask Eliza to release legendaries at her house.",
    "Krowr": "It can be only found roaming in the Precursor Valley but might need to complete the DLC and ask Eliza to release legendaries at her house.",
    "Ogoon":"It can be only found roaming in the Precursor Valley but might need to complete the DLC and ask Eliza to release legendaries at her house.",
    "Agita": "We need to collect the CHAOS discs from the Abyssals DLC and take them to the same scientist from The Extinction Project quest so he can resurrect Agita. We need to ask Eliza to release legendaries at her house and once this is activated, we'll find Agita anywhere in the Precursor Valley region.",
    "Anima": "We need to collect the CHAOS discs from the Abyssals DLC and take them to the same scientist from The Extinction Project quest so he can resurrect Anima. We need to ask Eliza to release legendaries at her house and once this is activated, we'll find Anima anywhere in the Precursor Valley region.",
    "Fulmina": "We need to collect the CHAOS discs from the Abyssals DLC and take them to the same scientist from The Extinction Project quest so he can resurrect Fulmina. We need to ask Eliza to release legendaries at her house and once this is activated, we'll find Fulmina anywhere in the Precursor Valley region",
    "Gurgita": "We need to collect the CHAOS discs from the Abyssals DLC and take them to the same scientist from The Extinction Project quest so he can resurrect Gurgita. We need to ask Eliza to release legendaries at her house and once this is activated, we'll find Gurgita anywhere in the Precursor Valley region.",
    "Helovolk": "Precursor Mountain - in the grass of dark forest maze, only available after beating Venefelis and releasing them by asking Eliza in her house. It is not necessary to go all the way to the cave at the end of the maze. Using a Friendship Berry as a Lure will increase the rate at which it shows up.",
    "Volcel": "Precursor Mountain - the grass to the east of the giant pot where the \"soup\" was made, only available after beating Venefelis and releasing them by asking Eliza in her house. Using a Friendship Berry as a Lure will increase the rate at which it shows up.",
    "Caelesa": "Precursor Mountain - the left side of the screen where the locked gate is, only available after beating Venefelis and releasing them by asking Eliza in her house. Using a Friendship Berry as a Lure will increase the rate at which it shows up.",
    "Pluvean": "Precursor Mountain - in the grass outside of the ice cavern, only available after beating Venefelis and releasing them by asking Eliza in her house. Pluvean can be found in any grass on that screen, not just the blue/frozen grass. Using a Friendship Berry as a Lure will increase the rate at which it shows up.",
    "Inominox": "Precursor Mountain - in the grass to the south of the mountain peak where Inominox is first encountered, only available after beating Venefelis and releasing them by asking Eliza in her house. Using a Friendship Berry as a Lure will increase the rate at which it shows up.",
    "Rotramus": "Precursor Mountain - in the woods to the west of the ice cavern, only available after beating Venefelis and releasing them by asking Eliza in her house. Using a Friendship Berry as a Lure will increase the rate at which it shows up.",
    "Kroma": "Precursor Mountain - in the maze before where the player encouters Kroma the first time, only available after beating Venefelis and releasing them by asking Eliza in her house. Using a Friendship Berry as a Lure will increase the rate at which it shows up.",
    "Braccus": "Precursor Mountain - inside the cave where all Nexomon take damage and start combat with burning, only available after beating Venefelis and releasing them by asking Eliza in her house. Using a Friendship Berry as a Lure will increase the rate at which it shows up.",
    "Venefelis": "Precursor Mountain - the screen to the south of where Venefelis was defeated, on the northern grass patches. It's only available after beating her and releasing all the Abyssals again by asking Eliza in her house. This means that the player must go through the puzzle maze again to get to the grass surrounding the ship to the north. Using a Friendship Berry as a Lure will increase the rate at which it shows up.",
    "Ziegler": "It used to be found roaming in all regions during the post-game. After the release of the Abyssals DLC this changed and now it can be only found roaming in the Precursor Valley once we have completed the DLC.",
    "Oregoon": "No known locations.",
    "Boscage": "It can be captured during The Drake of Nature quest. After that, we can talk to Eliza to release captured legendaries again and it'll likely appear in the Hidden Village region, although this hasn't been confirmed.",
    "Tyrake": "It can be captured during The Drake of Wind quest. After that, we can talk to Eliza to release captured legendaries again and it'll appear in the Drake Isles.",
    "Krainnull": "It can be captured during The Drake of Decay quest. After that, we can talk to Eliza to release captured legendaries again and it'll likely appear in the Immortal Citadel region, although this hasn't been confirmed.",
    "Nivalis": "It can be captured during the post-game in the Frozen Tundra.",
    "Tikala": "It can be captured during the post-game in the Hidden Village region.",
    "Eurus": "It can be captured during the post-game in the Drake Isles."
  }
  